-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июл 31 2022 г., 18:45
-- Версия сервера: 5.7.33
-- Версия PHP: 7.4.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `the_brand`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cart`
--

CREATE TABLE `cart` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` int(11) NOT NULL,
  `quantity` int(11) NOT NULL DEFAULT '1',
  `session_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `color` varchar(15) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `size` varchar(15) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `cart`
--

INSERT INTO `cart` (`id`, `product_id`, `title`, `price`, `quantity`, `session_id`, `color`, `size`) VALUES
(13, 71, 'ALLSAINTS', 43290, 1, '8kcc3f79hk4pbc227tkdprkvl24i9hgm', '', 's');

-- --------------------------------------------------------

--
-- Структура таблицы `catalog`
--

CREATE TABLE `catalog` (
  `id` int(11) NOT NULL,
  `title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` int(11) NOT NULL,
  `popularity` int(11) NOT NULL,
  `category` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `types` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `catalog`
--

INSERT INTO `catalog` (`id`, `title`, `description`, `price`, `popularity`, `category`, `types`) VALUES
(1, 'colorplay', 'Худи с логотипом бренда', 6990, 5, 'women', 'HaS'),
(2, 'ovs', 'Однотонная футболка из хлопка', 990, 12, 'women', 't-shirts'),
(3, 'desigual', 'Рубашка с цветочным принтом', 9990, 18, 'women', 'shirts'),
(4, 'ovs', 'Однотонная футболка из хлопка', 990, 3, 'women', 't-shirts'),
(5, 'cap horn', 'Базовая футболка', 1390, 5, 'men', 't-shirts'),
(6, 'boss', 'Шапка из шерсти', 5700, 2, 'men', 'accessories'),
(7, 'cap horn', 'Базовая футболка', 1390, 4, 'men', 't-shirts'),
(8, 'Худи', 'Хлопковая толстовка с капюшоном на молнии', 4590, 6, 'men', 'HaS'),
(9, 'Emme Marella', 'Зауженные брюки', 6490, 0, 'women', 'PaJ'),
(10, 'BOSS', 'Рубашка с добавлением льна', 31200, 0, 'women', 'shirts'),
(11, 'HUGO', 'Длинный плащ с поясом', 36040, 0, 'women', 'JaC'),
(12, 'ALDO', 'Лаковая сумка-тоут', 5990, 4, 'women', 'bags'),
(13, 'IDO', 'Джеггинсы с лампасами', 2290, 0, 'kids', 'PaJ'),
(14, 'Carter\'s', 'Комплект из футболки и леггинсов', 1540, 0, 'kids', 't-shirts'),
(15, 'Carter\'s', 'Лонгслив с пуговицами', 1300, 0, 'kids', 'HaS'),
(16, 'PLAYTODAY', 'Джинсовое платье', 1790, 0, 'kids', 'suits'),
(17, 'BELUCCI', 'Отрезной сарафан из хлопка', 7690, 2, 'women', 'shirts'),
(18, 'OVS', 'Платье с кулиской на талии', 3990, 0, 'women', 'suits'),
(19, 'Karl Lagerfeld', 'Комбинезон с контрастными вставками', 25890, 4, 'women', 'suits'),
(20, 'BOSS', 'Жакет из шерсти', 22740, 5, 'women', 'suits'),
(21, 'Construe', 'Чехол для ноутбука из натуральной кожи', 9990, 5, 'men', 'bags'),
(22, 'Construe', 'Текстильная косметичка', 2590, 2, 'women', 'bags'),
(23, 'Guess', 'Сумка на плечо', 9290, 0, 'men', 'bags'),
(24, 'BOSS', 'Текстильная сумка бизнес', 28990, 10, 'men', 'bags'),
(25, 'ELEGANZZA', 'Зонт-Автомат', 5800, 0, 'men', 'accessories'),
(26, 'ELEGANZZA', 'Зонт-Автомат', 5800, 0, 'men', 'accessories'),
(27, 'Calvin Klein Jeans', 'Бейсболка с монограммой бренда', 4610, 8, 'men', 'accessories'),
(28, 'COLORPLAY', 'Хлопковое худи с логотипом', 6010, 8, 'men', 'HaS'),
(29, 'MARCO DI RADI', 'Однотонные брюки', 3990, 0, 'men', 'PaJ'),
(30, 'MARCO DI RADI', 'Брюки карго', 4290, 0, 'men', 'PaJ'),
(31, 'COLORPLAY', 'Хлопковая футболка с логотипом', 2790, 8, 'men', 't-shirts'),
(32, 'Bodyguard', 'Хлопковое поло', 1810, 5, 'men', 'polo'),
(33, 'Esprit Casual', 'Футболка из хлопка', 3670, 0, 'men', 't-shirts'),
(34, 'MARCO DI RADI', 'Джоггеры с карманами', 5270, 0, 'men', 'PaJ'),
(35, 'MARCO DI RADI', 'Хлопковая футболка с принтом', 2090, 0, 'men', 't-shirts'),
(36, 'Construe', 'Хлопковый пуловер с о-образным вырезом', 2790, 0, 'men', 'HaS'),
(37, 'Tommy Hilfiger', 'Худи с логотипом бренда', 13590, 5, 'men', 'HaS'),
(38, 'MARCO DI RADI', 'Однотонные шорты из хлопка', 4190, 5, 'men', 'PaJ'),
(39, 'Calvin Klein Jeans', 'Джоггеры с карманами', 11990, 2, 'men', 'PaJ'),
(40, 'Only & Sons', 'Рубашка с коротким рукавом из хлопка', 2790, 2, 'men', 'shirts'),
(41, 'Cap Horn', 'Джинсы с эффектом потертости', 6990, 2, 'men', 'PaJ'),
(42, 'LEVI\'S', 'Джинсы 511 Slim Native Cali', 16990, 2, 'men', 'PaJ'),
(43, 'BOSS', 'Пиджак из натуральной шерсти', 19540, 6, 'men', 'suits'),
(44, 'DIGEL', 'Пиджак с накладными карманами', 12490, 4, 'men', 'suits'),
(45, 'Tommy Hilfiger Tailored', 'Пиджак', 14990, 0, 'men', 'suits'),
(46, 'HUGO', 'Пиджак из натуральной шерсти', 20150, 4, 'men', 'suits'),
(47, 'Pierre Cardin', 'Поло из хлопка', 6990, 4, 'men', 'polo'),
(48, 'Superdry', 'Куртка с капюшоном', 15390, 0, 'men', 'JaC'),
(49, 'Pierre Cardin', 'Утепленная стеганая куртка', 19240, 0, 'men', 'JaC'),
(50, 'Tommy Hilfiger', 'Утепленная парка с капюшоном', 33590, 0, 'men', 'JaC'),
(51, 'Guess', 'Кроссовки на шнуровке', 7190, 4, 'men', 'shoes'),
(52, 'NAPAPIJRI', 'Кожаные кеды', 8390, 4, 'men', 'shoes'),
(53, 'Geox', 'Ботинки на шнуровке', 10790, 0, 'men', 'shoes'),
(54, 'Ever be', 'Кожаные туфли', 5990, 0, 'men', 'shoes'),
(55, 'Hatparad', 'Соломенная шляпа', 4890, 0, 'women', 'accessories'),
(56, 'Fraas', 'Платок с бахромой', 4490, 0, 'women', 'accessories'),
(57, 'IZIPIZI', 'Солнцезащитные очки #H', 6890, 0, 'women', 'accessories'),
(58, 'Hatparad', 'Панама из хлопка', 4490, 0, 'women', 'accessories'),
(59, 'Karl Lagerfeld', 'Сумка шоппер с принтом Karl Karlimals', 6590, 0, 'women', 'bags'),
(60, 'SABRINA SCALA', 'Кожаный кошелек на молнии', 2990, 0, 'women', 'bags'),
(61, 'HUGO', 'Костюмный жакет асимметричного кроя', 23790, 5, 'women', 'suits'),
(62, 'BOSS', 'Шерстяной костюмный жакет', 27290, 5, 'women', 'suits'),
(63, 'HUGO', 'Однобортный пиджак', 38990, 5, 'women', 'suits'),
(64, 'BOSS', 'Пуловер с V-образным вырезом', 11090, 0, 'women', 'HaS'),
(65, 'Paola Ray', 'Свитер с высоким воротником', 8460, 0, 'women', 'HaS'),
(66, 'Tommy Jeans', 'Вязаный кардиган свободного кроя', 11290, 4, 'women', 'HaS'),
(67, 'BELUCCI', 'Вязаный свитер в стиле колорблок', 3490, 0, 'women', 'HaS'),
(68, 'A + MORE', 'Пончо в клетку с бахромой', 5590, 0, 'womes', 'HaS'),
(69, 'Rinascimento', 'Пуловер с воротником-стойкой', 2790, 0, 'womes', 'HaS'),
(70, 'BELUCCI', 'Куртка на молнии', 13500, 0, 'women', 'JaC'),
(71, 'Allsaints', 'Комбинированная куртка-бомбер', 43290, 8, 'women', 'JaC'),
(72, 'iBlues', 'Длинный стеганый пуховик', 19590, 0, 'women', 'JaC'),
(73, 'Vero Moda', 'Вязаное поло', 3420, 0, 'women', 'polo'),
(74, 'Superdry', 'Поло', 2440, 0, 'women', 'polo'),
(75, 'OVS', 'Укороченное поло', 1030, 5, 'women', 'polo'),
(76, 'OVS', 'Поло свободного кроя', 2390, 0, 'women', 'polo'),
(77, 'Noom', 'Удлиненная рубашка с добавлением льна', 4790, 0, 'women', 'shirts'),
(78, 'Paola Ray', 'Однотонная рубашка с отложным воротником', 4490, 0, 'women', 'shirts'),
(79, 'BELUCCI', 'Рубашка в клетку', 6430, 0, 'women', 'shirts'),
(80, 'Paola Ray', 'Рубашка оверсайз в клетку', 7270, 0, 'women', 'shirts'),
(81, 'Betty Barclay', 'Рубашка в полоску', 7990, 0, 'women', 'shirts'),
(82, 'Crocs', 'Пантолеты Bayaband', 6490, 0, 'women', 'shoes'),
(83, 'HUGO', 'Текстильные кеды', 5290, 0, 'women', 'shoes'),
(84, 'Ever be', 'Кожаные босоножки с ремешком на щиколотке', 2990, 0, 'women', 'shoes'),
(85, 'Enfasis', 'Сланцы с ярким принтом', 990, 0, 'women', 'shoes'),
(86, 'Lauren Ralph Lauren', 'Кожаные лодочки', 9350, 0, 'women', 'shoes'),
(87, 'Paola Ray', 'Босоножки на платформе', 9995, 0, 'women', 'shoes'),
(88, 'TWINSET', 'Футболка с текстовым принтом', 5490, 0, 'women', 't-shirts'),
(89, 'Rinascimento', 'Футболка с принтом и декором', 3140, 0, 'women', 't-shirts'),
(90, 'Desigual', 'Футболка с принтом Mickey Mouse', 5490, 0, 'women', 't-shirts'),
(91, 'Emme Marella', 'Футболка с декором', 4790, 0, 'women', 't-shirts'),
(92, 'Emme Marella', 'Футболка в полоску', 4790, 0, 'women', 't-shirts'),
(93, 'Gerry Weber', 'Брюки из экокожи', 7340, 0, 'women', 'PaJ'),
(94, 'Noom', 'Брюки с кулиской на талии', 3990, 0, 'women', 'PaJ'),
(95, 'Karl Lagerfeld', 'Широкие брюки', 17070, 0, 'women', 'PaJ'),
(96, 'Paola Ray', 'Однотонные брюки', 6780, 0, 'women', 'PaJ'),
(97, 'HUGO', 'Легинсы супероблегающего кроя из экокожи', 11090, 0, 'women', 'PaJ'),
(98, 'BELUCCI', 'Брюки широкого кроя со стрелками', 4190, 0, 'women', 'PaJ'),
(99, 'Silver Spoon', 'Однотонный галстук', 590, 0, 'kids', 'accessories'),
(100, 'Malina by Андерсен', 'Резинка-бант с декоративными бусинами', 1190, 0, 'kids', 'accessories'),
(101, 'Silver Spoon', 'Галстук-бабочка', 490, 0, 'kids', 'accessories'),
(102, 'Malina by Андерсен', 'Ободок с бантом', 690, 0, 'kids', 'accessories'),
(103, 'Silver Spoon Bags', 'Школьный рюкзак', 3990, 0, 'kids', 'bags'),
(104, 'Spacejunk', 'Текстильный рюкзак с принтом', 5590, 0, 'kids', 'bags'),
(105, 'Silver Spoon Bags', 'Школьный рюкзак', 3290, 0, 'kids', 'bags'),
(106, 'Herlitz', 'Ранец Ultralight Space', 6890, 0, 'kids', 'bags'),
(107, 'Silver Spoon Bags', 'Текстильная сумка', 590, 0, 'kids', 'bags'),
(108, 'Silver Spoon', 'Жилет на пуговицах', 2790, 0, 'kids', 'suits'),
(109, 'Choupette', 'Жакет из трикотажного бархата', 6290, 0, 'kids', 'suits'),
(110, 'Silver Spoon', 'Жилет удлиненный', 3990, 0, 'kids', 'suits'),
(111, 'Silver Spoon', 'Костюм из пиджака и брюк', 10990, 0, 'kids', 'suits'),
(112, 'Silver Spoon', 'Костюм из пиджака и брюк', 9990, 0, 'kids', 'suits'),
(113, 'PLAYTODAY', 'Свитер с принтом', 1890, 0, 'kids', 'HaS'),
(114, 'PLAYTODAY', 'Трикотажный свитер из вискозы', 1190, 0, 'kids', 'HaS'),
(115, 'Silver Spoon', 'Джемпер из вискозы', 4590, 0, 'kids', 'HaS'),
(116, 'Silver Spoon', 'Джемпер с отложным воротником', 4790, 0, 'kids', 'HaS'),
(117, 'Silver Spoon', 'Шерстяное пальто с капюшоном', 12590, 0, 'kids', 'JaC'),
(118, 'PLAYTODAY', 'Утепленная куртка', 3590, 0, 'kids', 'JaC'),
(119, 'Silver Spoon', 'Пальто из смесовой шерсти', 9990, 0, 'kids', 'JaC'),
(120, 'PLAYTODAY', 'Ветровка с капюшоном', 2190, 0, 'kids', 'JaC'),
(121, 'PLAYTODAY', 'Поло из хлопка', 990, 0, 'kids', 'polo'),
(122, 'PLAYTODAY', 'Поло с контрастной отделкой', 1090, 0, 'kids', 'polo'),
(123, 'PLAYTODAY', 'Поло в полоску', 990, 0, 'kids', 'polo'),
(124, 'PLAYTODAY', 'Однотонное поло из хлопка', 990, 0, 'kids', 'polo'),
(125, 'Silver Spoon', 'Хлопковая блуза на пуговицах', 3990, 0, 'kids', 'shirts'),
(126, 'Junior Republic', 'Хлопковая рубашка', 4990, 0, 'kids', 'shirts'),
(127, 'PLAYTODAY', 'Рубашка в клетку', 1490, 0, 'kids', 'shirts'),
(128, 'Silver Spoon', 'Однотонная рубашка из хлопка', 4290, 0, 'kids', 'shirts'),
(129, 'Geox', 'Комбинированные кроссовки', 2990, 0, 'kids', 'shoes'),
(130, 'PLAYTODAY', 'Cандалии на липучках', 1590, 0, 'kids', 'shoes'),
(131, 'Geox', 'Высокие кеды со светодиодами на подошве', 8390, 0, 'kids', 'shoes'),
(132, 'PLAYTODAY', 'Сандалии на липучках', 1590, 0, 'kids', 'shoes'),
(133, 'PLAYTODAY', 'Удлиненная футболка из сетки', 1090, 0, 'kids', 't-shirts'),
(134, 'PLAYTODAY', 'Футболка с принтом Minnie Mouse', 790, 0, 'kids', 't-shirts'),
(135, 'PLAYTODAY', 'Футболка в стиле колорблок', 790, 0, 'kids', 't-shirts'),
(136, 'PLAYTODAY', 'Хлопковая футболка с принтом', 790, 0, 'kids', 't-shirts'),
(137, 'PLAYTODAY', 'Джоггеры с накладными карманами', 1890, 0, 'kids', 'PaJ'),
(138, 'PLAYTODAY', 'Джоггеры с принтом', 1290, 0, 'kids', 'PaJ'),
(139, 'PLAYTODAY', 'Хлопковый комбинезон с поясом', 2190, 0, 'kids', 'PaJ'),
(140, 'PLAYTODAY', 'Однотонные брюки из хлопка', 1590, 0, 'kids', 'PaJ');

-- --------------------------------------------------------

--
-- Структура таблицы `colors`
--

CREATE TABLE `colors` (
  `id` int(11) NOT NULL,
  `id_product` int(11) NOT NULL,
  `red` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `orange` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `yellow` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `green` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `blue` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `white` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `black` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `gray` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `colors`
--

INSERT INTO `colors` (`id`, `id_product`, `red`, `orange`, `yellow`, `green`, `blue`, `white`, `black`, `gray`) VALUES
(1, 2, '+', '-', '+', '+', '+', '+', '+', '-'),
(3, 1, '-', '-', '+', '+', '+', '-', '-', '-'),
(4, 4, '-', '-', '-', '+', '+', '+', '-', '-'),
(5, 9, '+', '-', '-', '-', '+', '-', '-', '-'),
(6, 10, '+', '-', '-', '-', '+', '+', '-', '-'),
(7, 11, '+', '-', '-', '-', '+', '+', '+', '-'),
(8, 17, '+', '-', '-', '-', '+', '-', '-', '-'),
(9, 18, '-', '-', '-', '+', '-', '-', '-', '-'),
(10, 19, '-', '-', '-', '-', '-', '+', '+', '+'),
(11, 20, '-', '-', '-', '+', '-', '-', '+', '+'),
(12, 22, '+', '+', '+', '+', '+', '-', '-', '-'),
(14, 60, '+', '+', '-', '-', '-', '+', '+', '-'),
(15, 61, '+', '-', '-', '-', '+', '+', '+', '+'),
(16, 62, '+', '-', '-', '-', '+', '+', '+', '-'),
(17, 63, '+', '-', '-', '-', '+', '-', '+', '-'),
(18, 64, '-', '-', '-', '-', '+', '-', '+', '+'),
(19, 65, '-', '-', '-', '-', '+', '+', '+', '+'),
(20, 66, '-', '-', '-', '-', '-', '+', '-', '+'),
(21, 67, '-', '+', '-', '+', '-', '+', '-', '-'),
(22, 70, '+', '-', '-', '+', '+', '-', '+', '+'),
(23, 72, '-', '-', '-', '-', '+', '-', '+', '+'),
(24, 73, '+', '+', '+', '+', '+', '-', '-', '+'),
(25, 74, '+', '+', '+', '+', '+', '+', '+', '+'),
(26, 75, '+', '+', '+', '+', '+', '-', '-', '-'),
(27, 76, '-', '-', '-', '-', '-', '-', '-', '-'),
(28, 77, '+', '-', '-', '+', '+', '+', '-', '-'),
(29, 78, '+', '-', '-', '-', '+', '+', '-', '-'),
(30, 80, '+', '+', '+', '+', '+', '-', '-', '-'),
(31, 81, '+', '-', '-', '-', '+', '-', '-', '+'),
(32, 86, '+', '', '', '+', '', '+', '+', ''),
(33, 88, '', '', '', '', '+', '+', '+', ''),
(34, 89, '', '', '+', '+', '+', '+', '', ''),
(35, 91, '', '+', '', '+', '+', '+', '', ''),
(36, 92, '', '', '', '', '+', '+', '', ''),
(37, 94, '', '', '', '', '+', '', '+', '+'),
(38, 95, '', '', '', '', '+', '', '+', '+'),
(39, 96, '', '', '', '+', '+', '', '+', '+'),
(40, 98, '', '+', '+', '+', '+', '', '+', '+'),
(41, 5, '+', '+', '+', '+', '+', '+', '+', '+'),
(42, 7, '+', '+', '+', '+', '+', '+', '+', '+'),
(43, 8, '', '', '', '', '+', '', '+', ''),
(44, 28, '', '', '+', '+', '+', '', '+', ''),
(45, 29, '+', '+', '+', '', '+', '+', '+', '+'),
(46, 30, '', '', '', '+', '+', '', '', '+'),
(47, 31, '+', '+', '+', '+', '+', '+', '+', '+'),
(48, 32, '+', '+', '+', '', '+', '', '', ''),
(49, 33, '+', '+', '', '', '+', '', '', ''),
(50, 34, '', '', '', '', '', '', '+', '+'),
(51, 35, '', '', '', '', '+', '', '+', '+'),
(52, 36, '', '', '', '', '+', '+', '+', '+'),
(53, 37, '', '+', '', '', '+', '', '+', ''),
(54, 38, '', '+', '', '+', '', '', '', '+'),
(55, 39, '', '', '', '', '+', '', '+', '+'),
(56, 42, '', '', '', '', '+', '', '+', ''),
(57, 44, '', '', '', '', '+', '', '+', '+'),
(58, 13, '', '', '', '', '+', '', '+', '+'),
(59, 108, '', '', '', '', '+', '', '+', '+'),
(60, 107, '+', '', '+', '', '+', '', '', '+'),
(61, 105, '', '', '', '', '', '+', '+', '+'),
(62, 110, '', '', '', '', '+', '', '+', '+'),
(63, 121, '', '+', '', '', '+', '+', '+', '+'),
(64, 124, '', '+', '+', '+', '', '+', '', '+'),
(65, 128, '', '+', '+', '+', '+', '', '+', ''),
(66, 138, '', '', '', '+', '+', '', '', '+'),
(67, 140, '', '+', '+', '', '+', '+', '', '+');

-- --------------------------------------------------------

--
-- Структура таблицы `offers`
--

CREATE TABLE `offers` (
  `id` int(11) NOT NULL,
  `session_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `country` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `city` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `postcode` int(6) NOT NULL,
  `fio` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `offers`
--

INSERT INTO `offers` (`id`, `session_id`, `country`, `city`, `postcode`, `fio`, `phone`, `email`) VALUES
(2, 'bon498s6kpomglbgmqvh3prs52e0ib3k', 'Россия', 'Самара', 443008, 'Денис Сазонов', '79276867129', 'greenfish@list.ru'),
(3, '8kcc3f79hk4pbc227tkdprkvl24i9hgm', 'Россия', 'Самара', 444444, 'Денис Сазонов', '79276867129', 'test@test.test');

-- --------------------------------------------------------

--
-- Структура таблицы `reviews`
--

CREATE TABLE `reviews` (
  `id` int(11) NOT NULL,
  `id_user` int(11) NOT NULL,
  `name` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `surname` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `photo_name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `review` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `reviews`
--

INSERT INTO `reviews` (`id`, `id_user`, `name`, `surname`, `photo_name`, `review`) VALUES
(2, 4, 'Денис', 'Сазонов', 'resume.jpg', 'Хороший магазин и удобный сайт!'),
(5, 5, 'Марина', ' Васина', 'default.png', 'Слишком дорого!'),
(6, 6, 'Иван', 'Иванов', 'blink_ava2.jpg', 'Привет из Беларуси!');

-- --------------------------------------------------------

--
-- Структура таблицы `sizes`
--

CREATE TABLE `sizes` (
  `id` int(11) NOT NULL,
  `id_product` int(11) NOT NULL,
  `xxs` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `xs` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `s` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `m` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `l` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `xl` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `xxl` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `26` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `27` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `28` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `29` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `30` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `31` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `32` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `33` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `34` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `35` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `36` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `37` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `38` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `39` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `40` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `41` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `42` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `43` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `44` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `45` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `122` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `128` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `134` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `140` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `146` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `152` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `158` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL,
  `164` varchar(1) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `sizes`
--

INSERT INTO `sizes` (`id`, `id_product`, `xxs`, `xs`, `s`, `m`, `l`, `xl`, `xxl`, `26`, `27`, `28`, `29`, `30`, `31`, `32`, `33`, `34`, `35`, `36`, `37`, `38`, `39`, `40`, `41`, `42`, `43`, `44`, `45`, `122`, `128`, `134`, `140`, `146`, `152`, `158`, `164`) VALUES
(1, 2, '-', '+', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(2, 3, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(3, 1, '-', '-', '+', '+', '+', '+', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(4, 4, '-', '+', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(5, 9, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(6, 10, '+', '-', '+', '-', '+', '+', '+', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(7, 11, '-', '-', '+', '+', '-', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(8, 17, '-', '-', '+', '+', '-', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(9, 18, '-', '-', '-', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(10, 19, '-', '+', '+', '+', '+', '+', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(11, 20, '+', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(12, 61, '+', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(13, 62, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(14, 63, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '-', '-', '-', '-', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(15, 64, '+', '+', '+', '+', '-', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(16, 65, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(17, 66, '+', '+', '+', '-', '-', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(18, 67, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(19, 70, '-', '-', '-', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(20, 71, '+', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(21, 72, '-', '-', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(22, 73, '-', '+', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(23, 74, '-', '+', '+', '+', '+', '+', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(24, 75, '+', '+', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(25, 76, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(26, 77, '-', '+', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(27, 78, '-', '-', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(28, 79, '-', '+', '+', '+', '+', '+', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(29, 80, '-', '+', '+', '+', '+', '+', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(30, 81, '-', '+', '+', '+', '+', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(31, 82, '-', '-', '-', '-', '-', '-', '-', '-', '-', '', '-', '-', '', '-', '-', '-', '+', '+', '+', '+', '+', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'),
(32, 83, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', ''),
(33, 84, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(34, 85, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', ''),
(35, 86, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(36, 87, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(37, 88, '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(38, 89, '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(39, 90, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(40, 91, '', '+', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(41, 92, '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(42, 93, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(43, 94, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(44, 95, '', '+', '', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(45, 96, '+', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(46, 97, '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(47, 98, '', '', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(48, 5, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(49, 7, '', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(50, 8, '', '', '', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(51, 28, '', '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(52, 29, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(53, 30, '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(54, 31, '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(57, 32, '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(58, 33, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(59, 34, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(60, 35, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(61, 36, '', '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(62, 37, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(65, 38, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(66, 39, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(67, 40, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(68, 41, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(69, 42, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(70, 43, '', '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(71, 44, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(72, 45, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(73, 46, '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(74, 47, '', '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(75, 48, '', '', '', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(76, 49, '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(77, 50, '', '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(78, 51, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', ''),
(79, 52, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', ''),
(80, 53, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', '', '', '', '', '', '', ''),
(81, 54, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', ''),
(82, 13, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '', ''),
(83, 16, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', '', ''),
(84, 108, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '+', ''),
(85, 109, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+'),
(86, 110, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+'),
(87, 111, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', ''),
(88, 112, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+'),
(89, 113, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', ''),
(90, 114, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', '', '', ''),
(91, 115, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '', ''),
(92, 116, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', ''),
(93, 117, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', ''),
(95, 118, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', '', ''),
(96, 119, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', ''),
(97, 120, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '', ''),
(98, 121, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', ''),
(99, 122, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '', '', '', '', '', ''),
(100, 123, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', '', '', ''),
(101, 124, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', '', ''),
(102, 125, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+'),
(103, 126, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', ''),
(104, 127, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', ''),
(105, 128, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', ''),
(106, 129, '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(107, 130, '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(108, 131, '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(109, 132, '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '+', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(110, 133, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', '', '', ''),
(111, 134, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', ''),
(112, 135, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '+', '', ''),
(113, 136, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', ''),
(114, 137, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', ''),
(115, 138, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', '', ''),
(116, 139, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '', '', '', ''),
(117, 140, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+', '+', '+', '+', '', '', '');

-- --------------------------------------------------------

--
-- Структура таблицы `subscribers`
--

CREATE TABLE `subscribers` (
  `id` int(11) NOT NULL,
  `email` varchar(75) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `subscribers`
--

INSERT INTO `subscribers` (`id`, `email`) VALUES
(1, 'test@test.ru');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `surname` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `gender` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `profile_photo` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'default.png',
  `country` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `city` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `postcode` int(6) DEFAULT NULL,
  `phone` varchar(12) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `about` text COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `surname`, `gender`, `email`, `password`, `profile_photo`, `country`, `city`, `postcode`, `phone`, `about`) VALUES
(4, 'Денис', 'Сазонов', 'мужчина', 'test@test.test', '$2y$10$9JZCLBCYqDJoc0R3SRbYWu/lzGX5mGUyS7NvYiqyFYGoh9LdzxNgi', 'resume.jpg', 'Россия', 'Самара', 444444, '79276867129', 'Я разработчик данного сайта.'),
(5, 'Марина', 'Васина', 'женщина', 'vasina@marina.ru', '$2y$10$i5gXYjTo4LRgW1lJXHdRMOG2PxSENUhLkyXNdBpEnPmr7tom0Ffsy', 'default.png', NULL, '', NULL, NULL, NULL),
(6, 'Иван', 'Иванов', 'мужчина', 'ivanIvan@mail.ru', '$2y$10$0A6G8HOjh2Ph0sBItelr1OUel0olnfO9/0si0afbpXsrnrk0mgHZq', 'blink_ava2.jpg', 'Беларусь', 'Минск', 123456, '72225472324', '\"А вы знаете откуда планировалось нападение? Я вам сейчас покажу!\"');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `catalog`
--
ALTER TABLE `catalog`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `colors`
--
ALTER TABLE `colors`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `offers`
--
ALTER TABLE `offers`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `reviews`
--
ALTER TABLE `reviews`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `sizes`
--
ALTER TABLE `sizes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `product_id` (`id_product`);

--
-- Индексы таблицы `subscribers`
--
ALTER TABLE `subscribers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cart`
--
ALTER TABLE `cart`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT для таблицы `catalog`
--
ALTER TABLE `catalog`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=141;

--
-- AUTO_INCREMENT для таблицы `colors`
--
ALTER TABLE `colors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=68;

--
-- AUTO_INCREMENT для таблицы `offers`
--
ALTER TABLE `offers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `reviews`
--
ALTER TABLE `reviews`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `sizes`
--
ALTER TABLE `sizes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=118;

--
-- AUTO_INCREMENT для таблицы `subscribers`
--
ALTER TABLE `subscribers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
